# Unix
brew "git"
brew "openssl"
brew "tmux"
brew "vim"
brew "zsh"

brew "gawk"
brew "pwgen"

# Encryption
brew "sops"

# Terraform
brew "terraform"
brew "tfenv"

# Azure
brew "azure-cli"

# AWS
brew "awscli"

# Kubernetes

brew "kubernetes-cli"
brew "kubernetes-helm"
brew "minikube"

# GitHub
brew "gh"


# Programming language prerequisites and package managers
brew "libyaml" # should come after openssl
brew "coreutils"
#cask "gpg-suite"

# Viscosity VPN client
cask "viscosity"

# LastPass GUI and CLI
cask "lastpass"
brew "lastpass-cli"

# Docker Desktop
cask "docker"%
